MartinUscanga/Robot-ESP32/esp32s3_robot_completo.ino
/**
 * ============================================================================
 * ESP32-S3 Robot Asistente con Audio Bidireccional + Pantalla ST7789
 * ============================================================================
 * 
 * Hardware:
 * - ESP32-S3
 * - Micrófono INMP441 (I2S)
 * - Altavoz MAX98357A (I2S DAC)
 * - Pantalla ST7789 240x320 (SPI)
 * 
 * Autor: Robot ESP32 Project
 * Versión: 2.0
 * ============================================================================
 */

#include <WiFi.h>
#include <HTTPClient.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <SPI.h>
#include <driver/i2s.h>
#include "esp_task_wdt.h"

// ============================================================================
// CONFIGURACIÓN DE PINES
// ============================================================================

// --- Pantalla ST7789 (SPI) ---
#define TFT_CS    10
#define TFT_DC    11
#define TFT_RST   12
#define TFT_MOSI  13
#define TFT_SCK   14

// --- Audio I2S ---
#define I2S_NUM_TX    (i2s_port_t)0  // Puerto I2S para Altavoz
#define I2S_NUM_RX    (i2s_port_t)1  // Puerto I2S para Micrófono

// Pines Altavoz MAX98357A (I2S TX)
#define I2S_SPEAKER_BCLK  16
#define I2S_SPEAKER_LRCK  17
#define I2S_SPEAKER_DOUT  15

// Pines Micrófono INMP441 (I2S RX)
#define I2S_MIC_BCLK      4
#define I2S_MIC_LRCK      5
#define I2S_MIC_DIN       6

// ============================================================================
// CONFIGURACIÓN RED Y API
// ============================================================================



#define WIFI_SSID         "Tenda_88ADC0"
#define WIFI_PASSWORD     "924113587"
#define API_URL           "http://18.221.246.87:8000"
#define DEVICE_ID         "esp32s3-display"

// ============================================================================
// CONFIGURACIÓN DE AUDIO
// ============================================================================

#define SAMPLE_RATE       16000          // Hz (16kHz para compatibilidad con API)
#define BITS_PER_SAMPLE   16             // Bits
#define RECORD_TIME       5              // Segundos de grabación
#define BUFFER_SIZE       512            // Tamaño del buffer I2S
#define RECORD_BUFFER_SIZE (SAMPLE_RATE * RECORD_TIME * sizeof(int16_t))

// ============================================================================
// CONFIGURACIÓN DE PANTALLA
// ============================================================================

#define SCREEN_WIDTH      240
#define SCREEN_HEIGHT     320
#define CENTER_X          (SCREEN_WIDTH / 2)
#define CENTER_Y          (SCREEN_HEIGHT / 2)

// Colores
#define COLOR_FONDO       0x001F    // Azul oscuro
#define COLOR_CARA        0xFFFF    // Blanco
#define COLOR_OJO         0x0000    // Negro
#define COLOR_BOCA        0xF800    // Rojo
#define COLOR_MEJILLA     0xFBEA    // Rosa claro
#define COLOR_TEXTO       0xFFFF    // Blanco
#define COLOR_VERDE       0x07E0    // Verde
#define COLOR_AMARILLO    0xFFE0    // Amarillo

// ============================================================================
// OBJETOS GLOBALES
// ============================================================================

Adafruit_ST7789 tft = Adafruit_ST7789(TFT_CS, TFT_DC, TFT_RST);

// ============================================================================
// ENUMERACIONES (DEBEN IR ANTES DE LAS FORWARD DECLARATIONS)
// ============================================================================

enum Estado {
  INICIALIZANDO,
  CONECTANDO_WIFI,
  ESPERANDO_COMANDO,
  GRABANDO_AUDIO,
  ENVIANDO_API,
  REPRODUCIENDO_RESPUESTA,
  ERROR_SISTEMA
};

enum Emocion {
  FELIZ,
  TRISTE,
  PENSANDO,
  SORPRENDIDO,
  ENOJADO,
  HABLANDO
};

// ============================================================================
// DECLARACIONES DE FUNCIONES (Forward Declarations)
// ============================================================================

// Inicialización
bool inicializarDisplay();
bool inicializarMicrofono();
bool inicializarAltavoz();
void conectarWiFi();

// Audio
void iniciarGrabacion();
size_t grabarAudio(uint8_t* buffer, size_t bufferSize);
void normalizarAudio(int16_t* samples, size_t numSamples);
void enviarAudioAPI();
void reproducirAudio(uint8_t* audioData, size_t audioSize);
void crearHeaderWAV(uint8_t* header, size_t dataSize);

// Pantalla
void dibujarPantallaInicio();
void dibujarCaraKawaii(Emocion emocion);
void animarCara();
void mostrarTextoEstado(String texto, uint16_t color);
void mostrarRespuestaTexto(String texto);
void dibujarCargando(int dots);
void mostrarBarraGrabacion(int progreso);
void mostrarError(String mensaje);

// Utilidades
String base64Decode(String input);

// ============================================================================
// VARIABLES GLOBALES
// ============================================================================

Estado estadoActual = INICIALIZANDO;
Emocion emocionActual = FELIZ;

uint8_t* audioBuffer = nullptr;
size_t audioBufferSize = 0;

unsigned long ultimoFrame = 0;
int animacionFrame = 0;
bool botonPresionado = false;

// ============================================================================
// FUNCIONES DE INICIALIZACIÓN
// ============================================================================

void setup() {
  Serial.begin(115200);
  delay(1000);
  
  Serial.println("\n\n");
  Serial.println("╔════════════════════════════════════════╗");
  Serial.println("║  ESP32-S3 Robot Asistente v2.0        ║");
  Serial.println("║  Con Audio Bidireccional + Display    ║");
  Serial.println("╚════════════════════════════════════════╝");
  Serial.println();
  
  // Configurar watchdog (compatible con Arduino Core 2.0.14+)
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(2, 0, 14)
    esp_task_wdt_config_t wdt_config = {
      .timeout_ms = 30000,  // 30 segundos
      .idle_core_mask = 0,  // No monitorear tareas idle
      .trigger_panic = false
    };
    esp_task_wdt_init(&wdt_config);
  #else
    // Para versiones anteriores
    esp_task_wdt_init(30, false);
  #endif
  
  // 1. Inicializar Display
  if (!inicializarDisplay()) {
    Serial.println("❌ Error crítico: No se pudo inicializar display");
    estadoActual = ERROR_SISTEMA;
    while(1) { delay(1000); }
  }
  
  // 2. Inicializar I2S para micrófono
  if (!inicializarMicrofono()) {
    Serial.println("❌ Error crítico: No se pudo inicializar micrófono");
    mostrarError("Error Micrófono");

