MartinUscanga/Robot-ESP32/esp32s3_robot_completo.ino
    estadoActual = ERROR_SISTEMA;
    while(1) { delay(1000); }
  }
  
  // 3. Inicializar I2S para altavoz
  if (!inicializarAltavoz()) {
    Serial.println("❌ Error crítico: No se pudo inicializar altavoz");
    mostrarError("Error Altavoz");
    estadoActual = ERROR_SISTEMA;
    while(1) { delay(1000); }
  }
  
  // 4. Conectar WiFi
  conectarWiFi();
  
  // 5. Reservar memoria para buffer de audio
  audioBuffer = (uint8_t*)ps_malloc(RECORD_BUFFER_SIZE);
  if (!audioBuffer) {
    Serial.println("❌ Error: No hay memoria suficiente para buffer de audio");
    mostrarError("Sin Memoria");
    estadoActual = ERROR_SISTEMA;
    while(1) { delay(1000); }
  }
  
  Serial.println("\n✅ Sistema iniciado correctamente");
  Serial.println("📝 Presiona ENTER para iniciar grabación");
  Serial.printf("💾 RAM libre: %d bytes\n", ESP.getFreeHeap());
  Serial.printf("💾 PSRAM libre: %d bytes\n", ESP.getFreePsram());
  
  estadoActual = ESPERANDO_COMANDO;
  dibujarCaraKawaii(FELIZ);
  mostrarTextoEstado("¡Listo! Presiona ENTER", COLOR_VERDE);
}

// ============================================================================
// LOOP PRINCIPAL
// ============================================================================

void loop() {
  // Leer comandos desde Serial
  if (Serial.available() > 0) {
    char c = Serial.read();
    if (c == '\n' || c == '\r') {

      if (estadoActual == ESPERANDO_COMANDO) {
        iniciarGrabacion();
      }
    }
  }
  
  // Animar cara cada 100ms
  unsigned long ahora = millis();
  if (ahora - ultimoFrame > 100) {
    ultimoFrame = ahora;
    animacionFrame++;
    
    if (estadoActual == ESPERANDO_COMANDO || estadoActual == REPRODUCIENDO_RESPUESTA) {
      animarCara();
    }
  }
  
  delay(10);
}

// ============================================================================
// INICIALIZACIÓN DE DISPLAY
// ============================================================================

bool inicializarDisplay() {
  Serial.println("🖥️  Inicializando Display ST7789...");
  
  try {
    // Configurar SPI manualmente
    SPI.begin(TFT_SCK, -1, TFT_MOSI, TFT_CS);
    SPI.setFrequency(40000000); // 40MHz
    
    // Inicializar display
    tft.init(SCREEN_WIDTH, SCREEN_HEIGHT, SPI_MODE2);
    delay(100);
    
    tft.setRotation(0); // Ajustar según orientación deseada
    tft.fillScreen(COLOR_FONDO);
    delay(50);
    
    // Mostrar pantalla de inicio
    dibujarPantallaInicio();
    
    Serial.println("   ✓ Display inicializado correctamente");
    return true;
    
  } catch (...) {
    return false;
  }
}


// ============================================================================
// INICIALIZACIÓN DE MICRÓFONO I2S (INMP441)
// ============================================================================

bool inicializarMicrofono() {
  Serial.println("🎤 Inicializando Micrófono INMP441 (I2S RX)...");
  
  i2s_config_t i2s_config_rx = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
    .sample_rate = SAMPLE_RATE,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 8,
    .dma_buf_len = BUFFER_SIZE,
    .use_apll = false,
    .tx_desc_auto_clear = false,
    .fixed_mclk = 0
  };
  
  i2s_pin_config_t pin_config_rx = {
    .bck_io_num = I2S_MIC_BCLK,
    .ws_io_num = I2S_MIC_LRCK,
    .data_out_num = I2S_PIN_NO_CHANGE,
    .data_in_num = I2S_MIC_DIN
  };
  
  esp_err_t err = i2s_driver_install(I2S_NUM_RX, &i2s_config_rx, 0, NULL);
  if (err != ESP_OK) {
    Serial.printf("   ✗ Error instalando driver I2S RX: %d\n", err);
    return false;
  }
  
  err = i2s_set_pin(I2S_NUM_RX, &pin_config_rx);
  if (err != ESP_OK) {
    Serial.printf("   ✗ Error configurando pines I2S RX: %d\n", err);
    return false;
  }
  
  // Limpiar buffer DMA
  i2s_zero_dma_buffer(I2S_NUM_RX);
  
  Serial.println("   ✓ Micrófono inicializado correctamente");
  Serial.printf("   • Sample Rate: %d Hz\n", SAMPLE_RATE);
  Serial.printf("   • Bits: %d\n", BITS_PER_SAMPLE);
  Serial.printf("   • Pines: BCLK=%d, LRCK=%d, DIN=%d\n", 
                I2S_MIC_BCLK, I2S_MIC_LRCK, I2S_MIC_DIN);
  
  return true;
}


// ============================================================================
// INICIALIZACIÓN DE ALTAVOZ I2S (MAX98357A)
// ============================================================================

bool inicializarAltavoz() {
  Serial.println("🔊 Inicializando Altavoz MAX98357A (I2S TX)...");
  
  i2s_config_t i2s_config_tx = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
    .sample_rate = SAMPLE_RATE,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 8,
    .dma_buf_len = BUFFER_SIZE,
    .use_apll = false,
    .tx_desc_auto_clear = true,
    .fixed_mclk = 0
  };
  
  i2s_pin_config_t pin_config_tx = {
    .bck_io_num = I2S_SPEAKER_BCLK,
    .ws_io_num = I2S_SPEAKER_LRCK,
    .data_out_num = I2S_SPEAKER_DOUT,
    .data_in_num = I2S_PIN_NO_CHANGE
  };
  
  esp_err_t err = i2s_driver_install(I2S_NUM_TX, &i2s_config_tx, 0, NULL);
  if (err != ESP_OK) {
    Serial.printf("   ✗ Error instalando driver I2S TX: %d\n", err);
    return false;
  }
  
  err = i2s_set_pin(I2S_NUM_TX, &pin_config_tx);
  if (err != ESP_OK) {
    Serial.printf("   ✗ Error configurando pines I2S TX: %d\n", err);
    return false;
  }
  
  // Limpiar buffer DMA
  i2s_zero_dma_buffer(I2S_NUM_TX);
  
  Serial.println("   ✓ Altavoz inicializado correctamente");
  Serial.printf("   • Sample Rate: %d Hz\n", SAMPLE_RATE);
  Serial.printf("   • Bits: %d\n", BITS_PER_SAMPLE);
  Serial.printf("   • Pines: BCLK=%d, LRCK=%d, DOUT=%d\n", 
                I2S_SPEAKER_BCLK, I2S_SPEAKER_LRCK, I2S_SPEAKER_DOUT);
  
  return true;
}


// ============================================================================
// CONECTAR WIFI
// ============================================================================

void conectarWiFi() {
  Serial.println("📡 Conectando a WiFi...");
  Serial.printf("   • SSID: %s\n", WIFI_SSID);
  
  estadoActual = CONECTANDO_WIFI;
  dibujarCaraKawaii(PENSANDO);
  mostrarTextoEstado("Conectando WiFi...", COLOR_AMARILLO);
  
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  
