MartinUscanga/Robot-ESP32/esp32s3_robot_completo.ino
  int intentos = 0;
  while (WiFi.status() != WL_CONNECTED && intentos < 30) {
    delay(500);
    Serial.print(".");
    intentos++;
    
    if (intentos % 3 == 0) {
      dibujarCargando(intentos / 3);
    }
  }
  
  Serial.println();
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("   ✓ WiFi conectado!");
    Serial.print("   • IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("   • RSSI: ");
    Serial.print(WiFi.RSSI());
    Serial.println(" dBm");
    
    dibujarCaraKawaii(FELIZ);
    mostrarTextoEstado("¡WiFi conectado!", COLOR_VERDE);
    delay(1500);
  } else {
    Serial.println("   ✗ Error: No se pudo conectar a WiFi");
    mostrarError("Error WiFi");
    estadoActual = ERROR_SISTEMA;
  }
}

// ============================================================================
// FUNCIONES DE DIBUJO - PANTALLA ST7789
// ============================================================================

void dibujarPantallaInicio() {
  tft.fillScreen(COLOR_FONDO);
  
  tft.setTextColor(COLOR_TEXTO);
  tft.setTextSize(3);
  tft.setCursor(30, 100);
  tft.println("Robot");
  
  tft.setCursor(20, 140);
  tft.println("Asistente");
  
  tft.setTextSize(1);
  tft.setCursor(50, 200);
  tft.println("ESP32-S3 + Gemini");
  
  tft.setTextSize(2);
  tft.setCursor(80, 240);
  tft.println("v2.0");
}



void dibujarCaraKawaii(Emocion emocion) {
  // Limpiar zona central (cara)
  tft.fillRect(0, 60, SCREEN_WIDTH, SCREEN_HEIGHT - 120, COLOR_FONDO);
  
  int caraY = CENTER_Y;
  
  // Ojos
  int ojoIzqX = CENTER_X - 40;
  int ojoDerX = CENTER_X + 40;
  int ojoY = caraY - 20;
  
  // Mejillas rosadas
  tft.fillCircle(CENTER_X - 70, caraY + 15, 15, COLOR_MEJILLA);
  tft.fillCircle(CENTER_X + 70, caraY + 15, 15, COLOR_MEJILLA);
  
  switch (emocion) {
    case FELIZ:
      // Ojos cerrados felices (líneas curvas)
      tft.fillRect(ojoIzqX - 18, ojoY, 36, 6, COLOR_OJO);
      tft.fillRect(ojoDerX - 18, ojoY, 36, 6, COLOR_OJO);
      
      // Boca sonriente grande
      tft.fillCircle(CENTER_X, caraY + 35, 30, COLOR_BOCA);
      tft.fillCircle(CENTER_X, caraY + 22, 30, COLOR_FONDO);
      break;
      
    case TRISTE:
      // Ojos grandes y tristes
      tft.fillCircle(ojoIzqX, ojoY, 12, COLOR_OJO);
      tft.fillCircle(ojoDerX, ojoY, 12, COLOR_OJO);
      tft.fillCircle(ojoIzqX, ojoY + 6, 4, COLOR_CARA);
      tft.fillCircle(ojoDerX, ojoY + 6, 4, COLOR_CARA);
      
      // Lágrimas
      for (int i = 0; i < 3; i++) {
        tft.fillCircle(ojoIzqX - 5, ojoY + 15 + i * 8, 3, 0x1B9F);
        tft.fillCircle(ojoDerX + 5, ojoY + 15 + i * 8, 3, 0x1B9F);
      }
      
      // Boca triste invertida
      tft.fillCircle(CENTER_X, caraY + 45, 28, COLOR_BOCA);
      tft.fillCircle(CENTER_X, caraY + 55, 28, COLOR_FONDO);
      break;
      
    case PENSANDO:
      // Ojos mirando hacia arriba derecha
      tft.fillCircle(ojoIzqX + 5, ojoY - 5, 12, COLOR_OJO);
      tft.fillCircle(ojoDerX + 5, ojoY - 5, 12, COLOR_OJO);
      tft.fillCircle(ojoIzqX + 5, ojoY - 8, 4, COLOR_CARA);
      tft.fillCircle(ojoDerX + 5, ojoY - 8, 4, COLOR_CARA);
      
      // Boca pequeña "hmm"
      tft.fillCircle(CENTER_X, caraY + 30, 10, COLOR_OJO);
      
      // Nubes de pensamiento
      tft.fillCircle(CENTER_X + 60, caraY - 40, 8, COLOR_CARA);
      tft.fillCircle(CENTER_X + 50, caraY - 30, 5, COLOR_CARA);
      tft.fillCircle(CENTER_X + 40, caraY - 20, 3, COLOR_CARA);
      break;
      
    case SORPRENDIDO:
      // Ojos muy abiertos
      tft.fillCircle(ojoIzqX, ojoY, 18, COLOR_OJO);
      tft.fillCircle(ojoDerX, ojoY, 18, COLOR_OJO);
      tft.fillCircle(ojoIzqX, ojoY, 6, COLOR_CARA);
      tft.fillCircle(ojoDerX, ojoY, 6, COLOR_CARA);
      
      // Boca "O" grande
      tft.fillCircle(CENTER_X, caraY + 35, 18, COLOR_OJO);
      tft.fillCircle(CENTER_X, caraY + 35, 12, COLOR_FONDO);
      break;

      
    case ENOJADO:
      // Cejas fruncidas en ángulo
      tft.fillTriangle(ojoIzqX - 20, ojoY - 15, ojoIzqX + 20, ojoY - 20, 
                       ojoIzqX + 20, ojoY - 10, COLOR_OJO);
      tft.fillTriangle(ojoDerX - 20, ojoY - 20, ojoDerX + 20, ojoY - 15, 
                       ojoDerX - 20, ojoY - 10, COLOR_OJO);
      
      // Ojos entrecerrados
      tft.fillRect(ojoIzqX - 12, ojoY, 24, 10, COLOR_OJO);
      tft.fillRect(ojoDerX - 12, ojoY, 24, 10, COLOR_OJO);
      
      // Boca enojada
      tft.fillRect(CENTER_X - 25, caraY + 35, 50, 5, COLOR_BOCA);
      break;
      
    case HABLANDO:
      // Ojos normales
      tft.fillCircle(ojoIzqX, ojoY, 12, COLOR_OJO);
      tft.fillCircle(ojoDerX, ojoY, 12, COLOR_OJO);
      tft.fillCircle(ojoIzqX, ojoY, 4, COLOR_CARA);
      tft.fillCircle(ojoDerX, ojoY, 4, COLOR_CARA);
      
      // Boca abierta (animada)
      if (animacionFrame % 2 == 0) {
        tft.fillCircle(CENTER_X, caraY + 30, 15, COLOR_BOCA);
        tft.fillCircle(CENTER_X, caraY + 30, 10, COLOR_OJO);
      } else {
        tft.fillCircle(CENTER_X, caraY + 30, 12, COLOR_BOCA);
        tft.fillCircle(CENTER_X, caraY + 30, 8, COLOR_OJO);
      }
      break;
  }
  
  emocionActual = emocion;
}

void animarCara() {
  // Parpadeo ocasional
  if (animacionFrame % 40 == 0 && 
      (emocionActual == FELIZ || emocionActual == ESPERANDO_COMANDO)) {
    int caraY = CENTER_Y;
    int ojoIzqX = CENTER_X - 40;
    int ojoDerX = CENTER_X + 40;
    int ojoY = caraY - 20;
    
    // Parpadeo
    tft.fillRect(ojoIzqX - 20, ojoY - 10, 40, 20, COLOR_FONDO);
    tft.fillRect(ojoDerX - 20, ojoY - 10, 40, 20, COLOR_FONDO);
    delay(100);
    dibujarCaraKawaii(emocionActual);
  }
  
  // Animación de boca al hablar
  if (emocionActual == HABLANDO) {
    dibujarCaraKawaii(HABLANDO);
  }
}

void mostrarTextoEstado(String texto, uint16_t color) {
  // Barra inferior
  tft.fillRect(0, SCREEN_HEIGHT - 40, SCREEN_WIDTH, 40, COLOR_FONDO);
  
  tft.setTextColor(color);
  tft.setTextSize(2);
  tft.setCursor(10, SCREEN_HEIGHT - 30);
  tft.println(texto.substring(0, 18)); // Max ~18 caracteres
}



void mostrarRespuestaTexto(String texto) {
  // Área de texto (encima de barra inferior)
  tft.fillRect(0, SCREEN_HEIGHT - 100, SCREEN_WIDTH, 60, COLOR_FONDO);
  
  tft.setTextColor(COLOR_TEXTO);
  tft.setTextSize(1);
  tft.setTextWrap(true);
  
