MartinUscanga/Robot-ESP32/esp32s3_robot_completo.ino
  int y = SCREEN_HEIGHT - 95;
  int maxChars = 38; // Caracteres por línea aproximadamente
  
  for (int i = 0; i < texto.length() && y < SCREEN_HEIGHT - 45; i += maxChars) {
    String linea = texto.substring(i, min((int)(i + maxChars), (int)texto.length()));
    tft.setCursor(5, y);
    tft.println(linea);
    y += 12;
  }
}

void dibujarCargando(int dots) {
  tft.fillRect(0, SCREEN_HEIGHT - 60, SCREEN_WIDTH, 20, COLOR_FONDO);
  tft.setTextSize(2);
  tft.setTextColor(COLOR_AMARILLO);
  tft.setCursor(60, SCREEN_HEIGHT - 55);
  
  String puntitos = "";
  for (int i = 0; i < (dots % 4); i++) {
    puntitos += ".";
  }
  tft.print("Cargando" + puntitos + "   ");
}

void mostrarBarraGrabacion(int progreso) {
  // Barra de progreso de grabación
  int barraX = 20;
  int barraY = SCREEN_HEIGHT - 50;
  int barraAncho = SCREEN_WIDTH - 40;
  int barraAlto = 20;
  
  // Fondo de barra
  tft.drawRect(barraX, barraY, barraAncho, barraAlto, COLOR_TEXTO);
  
  // Progreso (0-100)
  int anchoProgreso = (barraAncho - 4) * progreso / 100;
  tft.fillRect(barraX + 2, barraY + 2, anchoProgreso, barraAlto - 4, COLOR_BOCA);
  
  // Texto de progreso
  tft.setTextColor(COLOR_TEXTO);
  tft.setTextSize(1);
  tft.setCursor(barraX + barraAncho / 2 - 15, barraY - 15);
  tft.print("Grabando: ");
  tft.print(progreso);
  tft.print("%");
}

void mostrarError(String mensaje) {
  tft.fillScreen(0xF800); // Rojo
  
  tft.setTextColor(COLOR_TEXTO);
  tft.setTextSize(2);
  tft.setCursor(30, CENTER_Y - 10);
  tft.println("ERROR");
  
  tft.setTextSize(1);
  tft.setCursor(20, CENTER_Y + 20);
  tft.println(mensaje);
}


// ============================================================================
// CAPTURA DE AUDIO DESDE MICRÓFONO
// ============================================================================

void iniciarGrabacion() {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("❌ Error: WiFi desconectado");
    mostrarError("Sin WiFi");
    delay(2000);
    estadoActual = ESPERANDO_COMANDO;
    dibujarCaraKawaii(TRISTE);
    mostrarTextoEstado("Reconectando...", COLOR_AMARILLO);
    conectarWiFi();
    return;
  }
  
  Serial.println("\n🎙️  Iniciando grabación...");
  estadoActual = GRABANDO_AUDIO;
  
  dibujarCaraKawaii(SORPRENDIDO);
  mostrarTextoEstado("¡Escuchando!", COLOR_BOCA);
  
  // Limpiar buffer DMA antes de grabar
  i2s_zero_dma_buffer(I2S_NUM_RX);
  delay(100);
  
  // Grabar audio
  size_t bytesGrabados = grabarAudio(audioBuffer, RECORD_BUFFER_SIZE);
  
  if (bytesGrabados > 0) {
    Serial.printf("   ✓ Grabados %d bytes (%d muestras)\n", 
                  bytesGrabados, bytesGrabados / sizeof(int16_t));
    
    audioBufferSize = bytesGrabados;
    
    // Enviar a la API
    enviarAudioAPI();
    
  } else {
    Serial.println("   ✗ Error: No se grabó audio");
    mostrarError("Error Grabación");
    delay(2000);
    estadoActual = ESPERANDO_COMANDO;
    dibujarCaraKawaii(FELIZ);
    mostrarTextoEstado("Intenta de nuevo", COLOR_AMARILLO);
  }
}

size_t grabarAudio(uint8_t* buffer, size_t bufferSize) {
  size_t bytesLeidos = 0;
  size_t totalBytes = 0;
  
  int16_t* samples = (int16_t*)buffer;
  size_t totalSamples = bufferSize / sizeof(int16_t);
  
  unsigned long inicioGrabacion = millis();
  int ultimoPorcentaje = 0;
  
  Serial.println("   📊 Capturando audio...");
  
  while (totalBytes < bufferSize) {
    // Leer datos del I2S
    esp_err_t result = i2s_read(I2S_NUM_RX, 
                                buffer + totalBytes, 
                                min((size_t)BUFFER_SIZE * 2, bufferSize - totalBytes),
                                &bytesLeidos, 
                                portMAX_DELAY);
    
    if (result == ESP_OK && bytesLeidos > 0) {
      totalBytes += bytesLeidos;
      
      // Actualizar barra de progreso
      int porcentaje = (totalBytes * 100) / bufferSize;
      if (porcentaje != ultimoPorcentaje && porcentaje % 10 == 0) {
        mostrarBarraGrabacion(porcentaje);
        Serial.printf("   • Progreso: %d%%\n", porcentaje);
        ultimoPorcentaje = porcentaje;
      }
    }
    
    // Timeout de seguridad
    if (millis() - inicioGrabacion > (RECORD_TIME * 1000 + 2000)) {
      Serial.println("   ⚠️  Timeout en grabación");
      break;
    }
  }
  
  // Normalizar y aplicar ganancia al audio
  normalizarAudio(samples, totalBytes / sizeof(int16_t));
  
  return totalBytes;
}

void normalizarAudio(int16_t* samples, size_t numSamples) {
  // Encontrar valor máximo
  int16_t maxVal = 0;
  for (size_t i = 0; i < numSamples; i++) {
    int16_t absVal = abs(samples[i]);
    if (absVal > maxVal) {
      maxVal = absVal;
    }
  }
  
  if (maxVal == 0) return; // Evitar división por cero
  
  // Aplicar ganancia para normalizar
  float ganancia = 32767.0 / (float)maxVal * 0.8; // 80% del máximo
  
  Serial.printf("   • Normalizando audio (ganancia: %.2f)\n", ganancia);
  
  for (size_t i = 0; i < numSamples; i++) {
    int32_t valor = (int32_t)(samples[i] * ganancia);
    // Limitar valores
    if (valor > 32767) valor = 32767;
    if (valor < -32768) valor = -32768;
    samples[i] = (int16_t)valor;
  }
}


// ============================================================================
// ENVÍO DE AUDIO A LA API
// ============================================================================

void enviarAudioAPI() {
  Serial.println("\n📤 Enviando audio a la API...");
  estadoActual = ENVIANDO_API;
  
  dibujarCaraKawaii(PENSANDO);
  mostrarTextoEstado("Procesando...", COLOR_AMARILLO);
  
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("   ✗ WiFi desconectado");
    mostrarError("Sin WiFi");
    delay(2000);
    estadoActual = ESPERANDO_COMANDO;
    dibujarCaraKawaii(TRISTE);
    mostrarTextoEstado("Presiona ENTER", COLOR_AMARILLO);
    return;
  }
  
  HTTPClient http;
  
  String url = String(API_URL) + "/chat";
  Serial.printf("   • URL: %s\n", url.c_str());
  
  http.begin(url);
  http.setTimeout(30000); // 30 segundos timeout
  
  // Crear boundary para multipart/form-data
  String boundary = "----ESP32Boundary" + String(millis());
  http.addHeader("Content-Type", "multipart/form-data; boundary=" + boundary);
  
