MartinUscanga/Robot-ESP32/esp32s3_robot_completo.ino
  // Construir cuerpo del POST
  String bodyStart = "--" + boundary + "\r\n";
  bodyStart += "Content-Disposition: form-data; name=\"device_id\"\r\n\r\n";
  bodyStart += String(DEVICE_ID) + "\r\n";
  bodyStart += "--" + boundary + "\r\n";
  bodyStart += "Content-Disposition: form-data; name=\"file\"; filename=\"audio.wav\"\r\n";
  bodyStart += "Content-Type: audio/wav\r\n\r\n";
  
  String bodyEnd = "\r\n--" + boundary + "--\r\n";
  
  // Crear header WAV
  uint8_t wavHeader[44];
  crearHeaderWAV(wavHeader, audioBufferSize);
  
  // Calcular tamaño total
  size_t totalSize = bodyStart.length() + sizeof(wavHeader) + audioBufferSize + bodyEnd.length();
  
  Serial.printf("   • Tamaño total: %d bytes\n", totalSize);
  
  // Crear buffer temporal para el cuerpo completo
  uint8_t* bodyBuffer = (uint8_t*)malloc(totalSize);
  if (!bodyBuffer) {
    Serial.println("   ✗ Error: No hay memoria para buffer de envío");
    mostrarError("Sin Memoria");
    http.end();
    delay(2000);
    estadoActual = ESPERANDO_COMANDO;
    return;
  }
  
  // Copiar todo al buffer
  size_t offset = 0;
  memcpy(bodyBuffer + offset, bodyStart.c_str(), bodyStart.length());
  offset += bodyStart.length();
  
  memcpy(bodyBuffer + offset, wavHeader, sizeof(wavHeader));
  offset += sizeof(wavHeader);
  
  memcpy(bodyBuffer + offset, audioBuffer, audioBufferSize);
  offset += audioBufferSize;
  
  memcpy(bodyBuffer + offset, bodyEnd.c_str(), bodyEnd.length());
  
  // Enviar POST
  Serial.println("   • Enviando petición HTTP...");
  int httpCode = http.POST(bodyBuffer, totalSize);
  
  free(bodyBuffer);
  
  Serial.printf("   • Código HTTP: %d\n", httpCode);
  
  if (httpCode == 200) {
    Serial.println("   ✓ Respuesta recibida!");
    
    // Leer header con texto de respuesta
    String textoB64 = http.header("X-Response-Text-B64");
    String textoRespuesta = "";
    
    if (textoB64.length() > 0) {
      textoRespuesta = base64Decode(textoB64);
      Serial.println("   📝 Respuesta: " + textoRespuesta);
      
      mostrarRespuestaTexto(textoRespuesta);
    }
    
    // Obtener audio de respuesta
    WiFiClient* stream = http.getStreamPtr();
    size_t audioSize = http.getSize();
    
    if (audioSize > 0 && audioSize < ESP.getFreePsram()) {
      Serial.printf("   🔊 Recibiendo audio: %d bytes\n", audioSize);
      
      uint8_t* audioRespuesta = (uint8_t*)ps_malloc(audioSize);
      if (audioRespuesta) {
        size_t bytesLeidos = stream->readBytes(audioRespuesta, audioSize);
        
        if (bytesLeidos > 0) {
          Serial.printf("   ✓ Audio recibido: %d bytes\n", bytesLeidos);
          reproducirAudio(audioRespuesta, bytesLeidos);
        }
        
        free(audioRespuesta);
      } else {
        Serial.println("   ✗ Error: No hay memoria para audio de respuesta");
      }
    }
    
  } else {
    Serial.printf("   ✗ Error HTTP: %d\n", httpCode);
    String error = http.getString();
    Serial.println("   Detalles: " + error);
    
    mostrarError("Error API");
    delay(2000);
  }
  
  http.end();
  
  // Volver a estado de espera
  delay(1000);
  estadoActual = ESPERANDO_COMANDO;
  dibujarCaraKawaii(FELIZ);
  mostrarTextoEstado("Presiona ENTER", COLOR_VERDE);
  Serial.println("\n✅ Listo para nueva consulta");
}



// Crear header WAV estándar
void crearHeaderWAV(uint8_t* header, size_t dataSize) {
  uint32_t chunkSize = dataSize + 36;
  uint32_t subchunk2Size = dataSize;
  uint16_t audioFormat = 1; // PCM
  uint16_t numChannels = 1; // Mono
  uint32_t sampleRate = SAMPLE_RATE;
  uint16_t bitsPerSample = BITS_PER_SAMPLE;
  uint32_t byteRate = sampleRate * numChannels * bitsPerSample / 8;
  uint16_t blockAlign = numChannels * bitsPerSample / 8;
  
  // RIFF header
  memcpy(header, "RIFF", 4);
  memcpy(header + 4, &chunkSize, 4);
  memcpy(header + 8, "WAVE", 4);
  
  // fmt subchunk
  memcpy(header + 12, "fmt ", 4);
  uint32_t subchunk1Size = 16;
  memcpy(header + 16, &subchunk1Size, 4);
  memcpy(header + 20, &audioFormat, 2);
  memcpy(header + 22, &numChannels, 2);
  memcpy(header + 24, &sampleRate, 4);
  memcpy(header + 28, &byteRate, 4);
  memcpy(header + 32, &blockAlign, 2);
  memcpy(header + 34, &bitsPerSample, 2);
  
  // data subchunk
  memcpy(header + 36, "data", 4);
  memcpy(header + 40, &subchunk2Size, 4);
}

// Decodificador Base64 simple
String base64Decode(String input) {
  const char* b64chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  String output = "";
  int val = 0, valb = -8;
  
  for (char c : input) {
    if (c == '=') break;
    const char* found = strchr(b64chars, c);
    if (!found) continue;
    
    val = (val << 6) + (found - b64chars);
    valb += 6;
    
    if (valb >= 0) {
      output += char((val >> valb) & 0xFF);
      valb -= 8;
    }
  }
  return output;
}


// ============================================================================
// REPRODUCCIÓN DE AUDIO EN ALTAVOZ
// ============================================================================

void reproducirAudio(uint8_t* audioData, size_t audioSize) {
  Serial.println("\n🔊 Reproduciendo audio...");
  estadoActual = REPRODUCIENDO_RESPUESTA;
  
  dibujarCaraKawaii(HABLANDO);
  mostrarTextoEstado("Hablando...", COLOR_VERDE);
  
  // Verificar si tiene header WAV
  size_t offset = 0;
  if (audioSize > 44 && memcmp(audioData, "RIFF", 4) == 0) {
    Serial.println("   • Detectado formato WAV, saltando header");
    offset = 44; // Saltar header WAV estándar
  }
  
  // Datos de audio PCM
  uint8_t* pcmData = audioData + offset;
  size_t pcmSize = audioSize - offset;
  
  Serial.printf("   • Tamaño PCM: %d bytes\n", pcmSize);
  Serial.printf("   • Duración aprox: %.1f segundos\n", 
                (float)pcmSize / (SAMPLE_RATE * sizeof(int16_t)));
  
  // Reproducir en bloques
  size_t bytesEscritos = 0;
  size_t totalEscrito = 0;
  size_t bloqueSize = BUFFER_SIZE * 4; // 2KB por bloque
  
  unsigned long inicioReproduccion = millis();
  
  while (totalEscrito < pcmSize) {
    size_t bytesAEscribir = min(bloqueSize, pcmSize - totalEscrito);
    
    esp_err_t result = i2s_write(I2S_NUM_TX, 
                                 pcmData + totalEscrito, 
                                 bytesAEscribir,
                                 &bytesEscritos, 
                                 portMAX_DELAY);
    
    if (result == ESP_OK) {
      totalEscrito += bytesEscritos;
      
      // Actualizar animación de cara cada 200ms
      if (millis() % 200 < 100) {
        dibujarCaraKawaii(HABLANDO);
      }
      
    } else {
      Serial.printf("   ✗ Error escribiendo I2S: %d\n", result);
      break;
    }
    
    // Timeout de seguridad (máximo 30 segundos)
    if (millis() - inicioReproduccion > 30000) {
      Serial.println("   ⚠️  Timeout en reproducción");
      break;
    }
  }
  
  // Esperar a que termine de reproducir el buffer DMA
  i2s_zero_dma_buffer(I2S_NUM_TX);
  delay(100);
  
  unsigned long duracion = millis() - inicioReproduccion;
  Serial.printf("   ✓ Reproducción completada en %lu ms\n", duracion);
  Serial.printf("   • Bytes escritos: %d / %d\n", totalEscrito, pcmSize);
  
  // Pequeña pausa antes de volver a estar listo
  delay(500);
}

